In [2]:
import pandas as pd

In [3]:
with open('/usr/share/dict/words') as f:
    words = f.read().split('\n')
print(words[:1])

['A']

In [4]:
pd.Series(words)[:10]

0           A
1           a
2          aa
3         aal
4       aalii
5         aam
6        Aani
7    aardvark
8    aardwolf
9       Aaron
dtype: object

In [5]:
pd.DataFrame({'word': words})[:10]

       word
0         A
1         a
2        aa
3       aal
4     aalii
5       aam
6      Aani
7  aardvark
8  aardwolf
9     Aaron

In [6]:
df = pd.DataFrame({'word': words})

In [7]:
df.word

0                  A
1                  a
2                 aa
3                aal
4              aalii
             ...
235882        Zythia
235883        zythum
235884       Zyzomys
235885    Zyzzogeton
235886
Name: word, Length: 235887, dtype: object

In [8]:
df.word.apply(len)

0          1
1          1
2          2
3          3
4          5
          ..
235882     6
235883     6
235884     7
235885    10
235886     0
Name: word, Length: 235887, dtype: int64

In [9]:
df['word_length'] = df.word.apply(len)

In [10]:
df

              word  word_length
0                A            1
1                a            1
2               aa            2
3              aal            3
4            aalii            5
...            ...          ...
235882      Zythia            6
235883      zythum            6
235884     Zyzomys            7
235885  Zyzzogeton           10
235886                        0

[235887 rows x 2 columns]

In [11]:
five_letter_words = df[df.word_length == 5]
five_letter_words

         word  word_length
4       aalii            5
9       Aaron            5
20      abaca            5
27      aback            5
35      abaff            5
...       ...          ...
235714  zudda            5
235749  zygal            5
235796  zygon            5
235840  zymic            5
235841  zymin            5

[10230 rows x 2 columns]

In [12]:
def alphabetical_value(ch: str) -> int:
    '''
    a -> 1
    b -> 2
    ...
    z -> 26
    '''
    return 'abcdefghijklmnopqrstuvwxyz'.index(ch.lower()) + 1
    
assert alphabetical_value('a') == 1
assert alphabetical_value('b') == 2
assert alphabetical_value('z') == 26

In [13]:
def test_word(word: str) -> bool:
    '''
    returns True if the alphabetical value of the first letter
    is the same as the sum of the alphabet values of the last
    four letters
    '''
    first_letter, *last_four = word
    return alphabetical_value(first_letter) == sum([alphabetical_value(ch) for ch in last_four])

In [14]:
test_word('chair')

False

In [15]:
test_word('zebra')

True

In [16]:
test_word('table')

True

In [23]:
five_letter_words.word.apply(test_word).head(12)

4     False
9     False
20    False
27    False
35    False
36    False
43    False
61    False
68    False
77    False
81    False
91    False
Name: word, dtype: bool

In [22]:
five_letter_words[five_letter_words.word.apply(test_word)]

         word  word_length
162735  raffe            5
172406  Sadie            5
181168  sifac            5
197206  table            5
210149  Uchee            5
226709  vakia            5
228545  Vicia            5
230352  wanga            5
231506  whack            5
234120  Xicak            5
234512  yeara            5
235088  zebra            5